---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.BottomOrInterior
enum: Autodesk.Revit.DB.Structure.ReinforcementBarOrientation
source: html/b67e1240-752a-316d-0e41-2000d19aa088.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementBarOrientation.BottomOrInterior

The major segment of the bar is on the bottom face (of a floor/slab) or the interior face (of a wall).